<?php
//1
$arr = ['a' => 11, 'b' => 20, 'c' => 30];
echo $arr['c'];
echo $arr['a'] + $arr['b'] + $arr['c'];

//2
$arr = ['q3'=>12, 'r3'=>23, 'f3'=>34];
echo $arr['q3'] + $arr['r3'] + $arr['f3'];

//3
$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo $arr['Коля'].$arr['Петя'];

//4
$m = [1 => Январь, 2 => 'Февраль', 3 => 'Март', 4 => 'Апрель', 5 => 'Май', 6 => 'Июнь', 7 => 'Июль', 8 => 'Август', 9 => 'Сентябрь', 10 => 'Октябрь', 11 => 'Ноябрь', 12 => 'Декабрь'];
echo $m['9'].'и'.$m['6'];

//5
$n = [1 => 'Понедельник', 2 => 'Вторник', 3 => 'Среда', 4 => 'Четверг', 5 => 'Пятница', 6 => 'Суббота', 7 => 'Воскресенье'];
$day = 3;
echo $n[$day];